---
title: LightFamily
classe: Autodesk.Revit.DB.Lighting.LightFamily
namespace: Autodesk.Revit.DB.Lighting
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# LightFamily

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `lightFamily.IsValidObject` | Boolean |
| `Void Dispose()` | `lightFamily.Dispose()` | Void |
| `LightDistributionStyle GetLightDistributionStyle()` | `lightFamily.GetLightDistributionStyle()` | LightDistributionStyle |
| `LightFamily GetLightFamily(Document)` | `LightFamily.GetLightFamily(document)` | LightFamily |
| `LightShapeStyle GetLightShapeStyle()` | `lightFamily.GetLightShapeStyle()` | LightShapeStyle |
| `Transform GetLightSourceTransform()` | `lightFamily.GetLightSourceTransform()` | Transform |
| `LightType GetLightType(Int32)` | `lightFamily.GetLightType(index)` | LightType |
| `String GetLightTypeName(Int32)` | `lightFamily.GetLightTypeName(index)` | String |
| `Int32 GetNumberOfLightTypes()` | `lightFamily.GetNumberOfLightTypes()` | Int32 |
| `Void SetLightDistributionStyle(LightDistributionStyle)` | `lightFamily.SetLightDistributionStyle(lightDistributionStyle)` | Void |
| `Void SetLightShapeStyle(LightShapeStyle)` | `lightFamily.SetLightShapeStyle(lightShapeStyle)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```